In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("airlines_usa.csv")
df.head()

,Year,Month,Day of Month,Day Of Week,Dep Time,CRS Dep Time,Arr Time,CRSArrTime,Air Time,Origin,Dest,Distance
0,2008,1,3,4,2003.0,1955,2211.0,2225,116.0,IAD,TPA,810
1,2008,1,3,4,754.0,735,1002.0,1000,113.0,IAD,TPA,810
2,2008,1,3,4,628.0,620,804.0,750,76.0,IND,BWI,515
3,2008,1,3,4,926.0,930,1054.0,1100,78.0,IND,BWI,515
4,2008,1,3,4,1829.0,1755,1959.0,1925,77.0,IND,BWI,515

In [3]:
df.tail()

,Year,Month,Day of Month,Day Of Week,Dep Time,CRS Dep Time,Arr Time,CRSArrTime,Air Time,Origin,Dest,Distance
49995,2008,1,18,5,1206.0,1200,1713.0,1705,172.0,LAX,HOU,1390
49996,2008,1,18,5,807.0,810,1306.0,1315,170.0,LAX,HOU,1390
49997,2008,1,18,5,1834.0,1815,1933.0,1920,45.0,LAX,LAS,236
49998,2008,1,18,5,725.0,725,821.0,825,42.0,LAX,LAS,236
49999,2008,1,18,5,1507.0,1500,1610.0,1605,48.0,LAX,LAS,236

In [4]:
df.sort_index()

,Year,Month,Day of Month,Day Of Week,Dep Time,CRS Dep Time,Arr Time,CRSArrTime,Air Time,Origin,Dest,Distance
0,2008,1,3,4,2003.0,1955,2211.0,2225,116.0,IAD,TPA,810
1,2008,1,3,4,754.0,735,1002.0,1000,113.0,IAD,TPA,810
2,2008,1,3,4,628.0,620,804.0,750,76.0,IND,BWI,515
3,2008,1,3,4,926.0,930,1054.0,1100,78.0,IND,BWI,515
4,2008,1,3,4,1829.0,1755,1959.0,1925,77.0,IND,BWI,515
...,...,...,...,...,...,...,...,...,...,...,...,...
49995,2008,1,18,5,1206.0,1200,1713.0,1705,172.0,LAX,HOU,1390
49996,2008,1,18,5,807.0,810,1306.0,1315,170.0,LAX,HOU,1390
49997,2008,1,18,5,1834.0,1815,1933.0,1920,45.0,LAX,LAS,236
49998,2008,1,18,5,725.0,725,821.0,825,42.0,LAX,LAS,236
49999,2008,1,18,5,1507.0,1500,1610.0,1605,48.0,LAX,LAS,236

In [5]:
print(df.Distance > 500)

0         True
1         True
2         True
3         True
4         True
         ...
49995     True
49996     True
49997    False
49998    False
49999    False
Name: Distance, Length: 50000, dtype: bool

In [6]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
print(mydict)

{'a': 0, 'b': 1, 'c': 2, 'e': 3, 'd': 4, 'f': 5, 'g': 6, 'h': 7, 'i': 8, 'j': 9, 'k': 10, 'l': 11, 'm': 12, 'n': 13, 'o': 14, 'p': 15, 'q': 16, 'r': 17, 's': 18, 't': 19, 'u': 20, 'v': 21, 'w': 22, 'x': 23, 'y': 24, 'z': 25}

In [7]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)
print(ser)

a     0
b     1
c     2
e     3
d     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int32

In [8]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

ser3 = ser1[~ser1.isin(ser2)]#items of serA not present in ser B
ser3

0    1
1    2
2    3
dtype: int64

In [9]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

# items not common to both serA and serB

ser3 = pd.Series(np.union1d(ser1, ser2))
ser4 = pd.Series(np.intersect1d(ser1, ser2))

ser5 = ser3[~ser3.isin(ser4)]
ser5

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

### 8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?

In [10]:
ser = pd.Series(np.random.normal(10,5,25))
print(ser)

print(np.percentile(ser , q=[0,25,50,75,100]))

0      7.712609
1     12.599844
2     11.119312
3     17.459431
4      3.303957
5     16.633194
6     10.838486
7     14.661072
8      9.630698
9      6.781719
10     4.133583
11    17.151311
12     7.152233
13    13.459106
14    16.351705
15    12.885690
16     9.924736
17    21.104297
18    12.966848
19     9.478379
20    18.429277
21    15.962970
22    17.235991
23     8.331310
24     5.733028
dtype: float64
[ 3.3039567   8.33131015 12.59984408 16.35170456 21.10429684]

### 9. How to get frequency counts of unique items of a series?

In [11]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

print(ser)

ser.value_counts()

0     f
1     a
2     g
3     c
4     f
5     b
6     f
7     g
8     a
9     c
10    a
11    b
12    g
13    d
14    d
15    b
16    b
17    h
18    g
19    g
20    c
21    d
22    a
23    d
24    e
25    f
26    d
27    d
28    f
29    b
dtype: object

d    6
f    5
g    5
b    5
a    4
c    3
h    1
e    1
dtype: int64

### 10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?

In [12]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(0,9,[18]))
print(ser)

print("Top 2 Freq:", ser.value_counts())
ser[~ser.isin(ser.value_counts().index[:2])] ="Other"
ser

0     6
1     7
2     7
3     1
4     2
5     0
6     7
7     0
8     7
9     3
10    4
11    5
12    5
13    8
14    2
15    4
16    0
17    2
dtype: int32
Top 2 Freq: 7    4
2    3
0    3
4    2
5    2
6    1
1    1
3    1
8    1
dtype: int64

0     Other
1         7
2         7
3     Other
4         2
5     Other
6         7
7     Other
8         7
9     Other
10    Other
11    Other
12    Other
13    Other
14        2
15    Other
16    Other
17        2
dtype: object

### 11. How to bin a numeric series to 10 groups of equal size?

In [13]:
ser = pd.Series(np.random.random(20))
ser

pd.qcut(ser, q=[0, .10, .20, .3, .4, .5, .6, .7, .8, .9, 1], 
        labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th']).head()

0    3rd
1    4th
2    7th
3    7th
4    1st
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

### 12. How to convert a numpy array to a dataframe of given shape? (L1)

In [14]:
ser = pd.Series(np.random.randint(1,10,35))
print(ser)

df = pd.DataFrame(ser.values.reshape(7,5))
print(df)

0     2
1     2
2     6
3     1
4     8
5     1
6     3
7     8
8     3
9     8
10    2
11    4
12    3
13    3
14    1
15    4
16    9
17    5
18    6
19    2
20    1
21    2
22    2
23    2
24    5
25    3
26    7
27    8
28    4
29    2
30    7
31    7
32    5
33    7
34    5
dtype: int32
   0  1  2  3  4
0  2  2  6  1  8
1  1  3  8  3  8
2  2  4  3  3  1
3  4  9  5  6  2
4  1  2  2  2  5
5  3  7  8  4  2
6  7  7  5  7  5

 ### 13. How to find the positions of numbers that are multiples of 3 from a series?

In [15]:
ser = pd.Series(np.random.randint(1,100,20))
print(ser)
for i in range(len(ser)):
    if ser[i] % 3 ==0:
        print(i)

0     65
1     96
2     23
3     23
4     20
5     64
6     40
7     68
8     63
9     19
10    54
11    54
12    61
13     8
14    61
15    95
16    98
17    59
18    30
19    98
dtype: int32
1
8
10
11
18

In [16]:
ser = pd.Series(list('jhgjghdhglhjflsghjjkhuhgjkf'))

pos = [0,6,4,6,23]
ser.take(pos)

0     j
6     d
4     g
6     d
23    g
dtype: object

### 15. How to stack two series vertically and horizontally ?

In [17]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list("abcde"))

print(ser1.append(ser2))

df = pd.concat([ser1,ser2],axis=1)
print(df)

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object
   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

C:\Users\Msc 1\AppData\Local\Temp\ipykernel_12268\3504814278.py:4: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  print(ser1.append(ser2))

### 16. How to get the positions of items of series A in another series B?

In [18]:
ser1 = pd.Series([10,9,6,5,1,12,8,13])
ser2 = pd.Series([1,3,10,13])

### 17. How to compute the mean squared error on a truth and predicted series?

In [19]:
truth = pd.Series(range(10))
print(truth)
pred = pd.Series(range(10))+np.random.random(10)
print(pred)

np.mean((truth-pred)**2)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64
0    0.537445
1    1.149564
2    2.310597
3    3.439316
4    4.210579
5    5.637480
6    6.868130
7    7.944909
8    8.313677
9    9.400185
dtype: float64

0.29564531961378593

### 18. How to convert the first character of each element in a series to uppercase?

In [20]:
ser = pd.Series(["om","sri","sai","ram"])
print(ser)

ser.map(lambda x: x.title())

0     om
1    sri
2    sai
3    ram
dtype: object

0     Om
1    Sri
2    Sai
3    Ram
dtype: object

### 19. How to calculate the number of characters in each word in a series?

In [21]:
ser = pd.Series(["om","sri","sai","raam"])
print(ser)

ser.map(lambda x: len(x))

0      om
1     sri
2     sai
3    raam
dtype: object

0    2
1    3
2    3
3    4
dtype: int64

### 20. How to compute difference of differences between consequtive numbers of a series?

In [22]:
ser = pd.Series([1,43,5,76,87,9,9,56])

print(ser.diff().tolist())
print(ser.diff().diff().tolist())

[nan, 42.0, -38.0, 71.0, 11.0, -78.0, 0.0, 47.0]
[nan, nan, -80.0, 109.0, -60.0, -89.0, 78.0, 47.0]

### 21. How to convert a series of date-strings to a timeseries?

In [23]:


ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
print(ser)
pd.to_datetime(ser)

0         01 Jan 2010
1          02-02-2011
2            20120303
3          2013/04/04
4          2014-05-05
5    2015-06-06T12:20
dtype: object

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

### 22. How to get the day of month, week number, day of year and day of week from a series of date strings?

In [24]:
ser = pd.Series(['09 Jan 2010', '09-07-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])


from dateutil.parser import parse
ser_ts = ser.map(lambda x : parse(x))

print( " date: " , ser_ts.dt.day.tolist())
print(" week : ",ser_ts.dt.weekofyear.tolist())
print(" day of year : ",ser_ts.dt.isocalendar())

 date:  [9, 7, 3, 4, 5, 6]
 week :  [1, 36, 9, 14, 19, 23]
 day of year :     year  week  day
0  2010     1    6
1  2011    36    3
2  2012     9    6
3  2013    14    4
4  2014    19    1
5  2015    23    6

C:\Users\Msc 1\AppData\Local\Temp\ipykernel_12268\989298836.py:8: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  print(" week : ",ser_ts.dt.weekofyear.tolist())

### 23. How to convert year-month string to dates corresponding to the 4th day of the month?

In [25]:
ser = pd.Series([' Jan 2019',' October 2022'])

# from dateutil.parser import parse
# ser_ts = ser.map(lambda x : parse(x))
# print(ser_ts.dt.isocalendar())

# ser_datestr =  ser_ts.dt.year.astype('str') + '-' + ser_ts.dt.month.astype('str')+ '-'+'04'


# [parse(i).strftime('%Y-%m-%d')  for i in ser_datestr]


ser.map(lambda x : parse('04' + x))

0   2019-01-04
1   2022-10-04
dtype: datetime64[ns]

### 24. How to filter words that contain atleast 2 vowels from a series?

In [26]:
ser =  pd.Series(['Varanasi','Sa','Kumar'])



from collections import Counter

mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')  ])>=2)

ser[mask]

0    Varanasi
2       Kumar
dtype: object

### 25. How to filter valid emails from a series?

In [27]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'


import re 

emails.str.findall(pattern, flags=re.IGNORECASE)

0                     []
1    [rameses@egypt.com]
2            [matt@t.co]
3    [narendra@modi.com]
dtype: object

### 26. How to get the mean of a series grouped by another series?

In [28]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weight = pd.Series(np.linspace(1, 10, 10))
print(weight.tolist())
print(fruit.tolist())

weight.groupby(fruit).mean()

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
['apple', 'carrot', 'banana', 'apple', 'carrot', 'carrot', 'carrot', 'apple', 'banana', 'apple']

apple     5.75
banana    6.00
carrot    5.00
dtype: float64

###  27. How to compute the euclidean distance between two series?

In [29]:
import math
p  = pd.Series([1,23,4,56,7,3,2,2])
q = pd.Series([1,2,4,56,7,3,2,2])

sum((p-q)**2)**.5

21.0

### 28. How to find all the local maxima (or peaks) in a numeric series?

In [30]:
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

dd = (np.sign(np.diff(ser)))
print(dd)
print(np.diff(dd))

peak_locations = np.where(np.diff(dd) == -2)[0] + 1

peak_locations

[ 1 -1  1  1  1 -1  1 -1]
[-2  2  0  0 -2  2 -2]

array([1, 5, 7], dtype=int64)

### 29. How to replace missing spaces in a string with the least frequent character?

In [31]:
stri =  "abos ksds oihs"

ser  =  pd.Series(list('dbc deb abed gade'))
print(ser)
freq = ser.value_counts()
print(freq)

least_freq =  freq.dropna().index[-1]

"".join(ser.replace('',least_freq))

0     d
1     b
2     c
3
4     d
5     e
6     b
7
8     a
9     b
10    e
11    d
12
13    g
14    a
15    d
16    e
dtype: object
d    4
b    3
     3
e    3
a    2
c    1
g    1
dtype: int64

'dbc deb abed gade'

### 30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?

In [32]:
ser = pd.Series(np.random.randint(1,10,10), pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
ser

2000-01-01    2
2000-01-08    6
2000-01-15    6
2000-01-22    6
2000-01-29    7
2000-02-05    9
2000-02-12    3
2000-02-19    1
2000-02-26    3
2000-03-04    2
Freq: W-SAT, dtype: int32

### 31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?

In [33]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
print(ser)

ser.resample('D').ffill()

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     NaN
dtype: float64

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

### 32. How to compute the autocorrelations of a numeric series?

In [34]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))
ser

autocorrelations = [ser.autocorr(i).round(2) for i in range(11)]
print(autocorrelations[1:])
print('Lag having highest correlation: ', np.argmax(np.abs(autocorrelations[1:]))+1)

[0.2, 0.43, 0.4, 0.73, 0.25, 0.35, 0.16, 0.66, 0.06, 0.41]
Lag having highest correlation:  4

### 33. How to import only every nth row from a csv file to create a dataframe?

In [35]:
df = pd.read_csv('airlines_usa.csv')
print(df)

df2 = pd.DataFrame()
df2

       Year  Month  Day of Month  Day Of Week  Dep Time      CRS Dep Time  \
0      2008      1             3            4    2003.0              1955
1      2008      1             3            4     754.0               735
2      2008      1             3            4     628.0               620
3      2008      1             3            4     926.0               930
4      2008      1             3            4    1829.0              1755
...     ...    ...           ...          ...       ...               ...
49995  2008      1            18            5    1206.0              1200
49996  2008      1            18            5     807.0               810
49997  2008      1            18            5    1834.0              1815
49998  2008      1            18            5     725.0               725
49999  2008      1            18            5    1507.0              1500

       Arr Time       CRSArrTime  Air Time Origin Dest  Distance
0        2211.0             2225     116.0    IAD  TPA       810
1        1002.0             1000     113.0    IAD  TPA       810
2         804.0              750      76.0    IND  BWI       515
3        1054.0             1100      78.0    IND  BWI       515
4        1959.0             1925      77.0    IND  BWI       515
...         ...              ...       ...    ...  ...       ...
49995    1713.0             1705     172.0    LAX  HOU      1390
49996    1306.0             1315     170.0    LAX  HOU      1390
49997    1933.0             1920      45.0    LAX  LAS       236
49998     821.0              825      42.0    LAX  LAS       236
49999    1610.0             1605      48.0    LAX  LAS       236

[50000 rows x 12 columns]

Empty DataFrame
Columns: []
Index: []

### 36. How to import only specified columns from a csv file?

In [38]:

df = pd.read_csv('airlines_usa.csv',usecols =['Year','Month'])
df

       Year  Month
0      2008      1
1      2008      1
2      2008      1
3      2008      1
4      2008      1
...     ...    ...
49995  2008      1
49996  2008      1
49997  2008      1
49998  2008      1
49999  2008      1

[50000 rows x 2 columns]

### 37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.

In [41]:
df = pd.read_csv('airlines_usa.csv')
print(df)

print(df.shape)
print(df.dtypes)


print(df.dtypes.value_counts())

df_stats = df.describe()

df_arr = df.values

df_list = df.values.tolist()

       Year  Month  Day of Month  Day Of Week  Dep Time      CRS Dep Time  \
0      2008      1             3            4    2003.0              1955
1      2008      1             3            4     754.0               735
2      2008      1             3            4     628.0               620
3      2008      1             3            4     926.0               930
4      2008      1             3            4    1829.0              1755
...     ...    ...           ...          ...       ...               ...
49995  2008      1            18            5    1206.0              1200
49996  2008      1            18            5     807.0               810
49997  2008      1            18            5    1834.0              1815
49998  2008      1            18            5     725.0               725
49999  2008      1            18            5    1507.0              1500

       Arr Time       CRSArrTime  Air Time Origin Dest  Distance
0        2211.0             2225     116.0    IAD  TPA       810
1        1002.0             1000     113.0    IAD  TPA       810
2         804.0              750      76.0    IND  BWI       515
3        1054.0             1100      78.0    IND  BWI       515
4        1959.0             1925      77.0    IND  BWI       515
...         ...              ...       ...    ...  ...       ...
49995    1713.0             1705     172.0    LAX  HOU      1390
49996    1306.0             1315     170.0    LAX  HOU      1390
49997    1933.0             1920      45.0    LAX  LAS       236
49998     821.0              825      42.0    LAX  LAS       236
49999    1610.0             1605      48.0    LAX  LAS       236

[50000 rows x 12 columns]
(50000, 12)
Year                  int64
Month                 int64
Day of Month          int64
Day Of Week           int64
Dep Time            float64
    CRS Dep Time      int64
Arr Time            float64
     CRSArrTime       int64
Air Time            float64
Origin               object
Dest                 object
Distance              int64
dtype: object
int64      7
float64    3
object     2
dtype: int64

### 39. How to rename a specific columns in a dataframe?

In [46]:
df = pd.read_csv('airlines_usa.csv')
print(df.columns)

df = df.rename(columns = {'Year': 'Yea'})
df.columns = df.columns.map(lambda x: x.replace('.','_'))
print(df.columns)

Index(['Year', 'Month', 'Day of Month', 'Day Of Week', 'Dep Time',
       '    CRS Dep Time', 'Arr Time', '     CRSArrTime', 'Air Time', 'Origin',
       'Dest', 'Distance'],
      dtype='object')
Index(['Yea', 'Month', 'Day of Month', 'Day Of Week', 'Dep Time',
       '    CRS Dep Time', 'Arr Time', '     CRSArrTime', 'Air Time', 'Origin',
       'Dest', 'Distance'],
      dtype='object')

### 40. How to check if a dataframe has any missing values?

In [48]:
df = pd.read_csv('airlines_usa.csv')


df.isnull().values.any()

True

### 41. How to count the number of missing values in each column?

In [50]:
df = pd.read_csv('airlines_usa.csv')

n_missings_each_col = df.apply(lambda x: x.isnull().sum())
n_missings_each_col.argmax()

6

### 42. How to replace missing values of multiple numeric columns with the mean?

In [52]:
df = pd.read_csv('airlines_usa.csv')

df_out = df[['Dep Time' ]] = df[['Dep Time']].apply(lambda x: x.fillna(x.mean()))
print(df_out.head())

   Dep Time
0    2003.0
1     754.0
2     628.0
3     926.0
4    1829.0

### 44. How to select a specific column from a dataframe as a dataframe instead of a series?

In [55]:
df = pd.read_csv('airlines_usa.csv')

df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

type(df[['a']])
type(df.loc[:, ['a']])
type(df.iloc[:, [0]])

type(df.a)
type(df['a'])
type(df.loc[:, 'a'])
type(df.iloc[:, 1])

pandas.core.series.Series

### 46. How to set the number of rows and columns displayed in the output?

In [58]:
df = pd.read_csv('airlines_usa.csv')

pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

df

,Year,Month,Day of Month,Day Of Week,Dep Time,...,CRSArrTime,Air Time,Origin,Dest,Distance
0,2008,1,3,4,2003.0,...,2225,116.0,IAD,TPA,810
1,2008,1,3,4,754.0,...,1000,113.0,IAD,TPA,810
2,2008,1,3,4,628.0,...,750,76.0,IND,BWI,515
3,2008,1,3,4,926.0,...,1100,78.0,IND,BWI,515
4,2008,1,3,4,1829.0,...,1925,77.0,IND,BWI,515
...,...,...,...,...,...,...,...,...,...,...,...
49995,2008,1,18,5,1206.0,...,1705,172.0,LAX,HOU,1390
49996,2008,1,18,5,807.0,...,1315,170.0,LAX,HOU,1390
49997,2008,1,18,5,1834.0,...,1920,45.0,LAX,LAS,236
49998,2008,1,18,5,725.0,...,825,42.0,LAX,LAS,236
49999,2008,1,18,5,1507.0,...,1605,48.0,LAX,LAS,236

### 48. How to format all the values in a dataframe as percentages?

In [68]:
df = pd.DataFrame(np.random.random(4), columns=['random'])
print(df)

out = df.style.format({
    'random': '{0:.2%}'.format,
})

out

     random
0  0.704765
1  0.308950
2  0.191287
3  0.399938

### 52. How to find the position of the nth largest value greater than a given value?

In [73]:
ser = pd.Series(np.random.randint(1, 300, 15))
print(ser)

print('ser: ', ser.tolist(), 'mean: ', round(ser.mean()))
np.argwhere(ser > ser.mean())[1]

0     167
1     145
2     136
3     135
4     148
     ...
10    283
11    119
12     39
13    135
14     41
Length: 15, dtype: int32
ser:  [167, 145, 136, 135, 148, 152, 274, 264, 166, 126, 283, 119, 39, 135, 41] mean:  155

ValueError: Length of values (1) does not match length of index (15)

### 56. How to swap two rows of a dataframe?

In [75]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))


def swap_rows(df, i1, i2):
    a, b = df.iloc[i1, :].copy(), df.iloc[i2, :].copy()
    df.iloc[i1, :], df.iloc[i2, :] = b, a
    return df

print(swap_rows(df, 1, 2))

    0   1   2   3   4
0   0   1   2   3   4
1  10  11  12  13  14
2   5   6   7   8   9
3  15  16  17  18  19
4  20  21  22  23  24

### 57. How to reverse the rows of a dataframe?

In [77]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))

df.iloc[::-1, :]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

### 59. Which column contains the highest number of row-wise maximum values?

In [80]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))

print('Column with highest row maxes: ', df.apply(np.argmax, axis=1).value_counts().index[0])

Column with highest row maxes:  1

### 61. How to know the maximum possible correlation value of each column against other columns?

In [82]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1), columns=list('pqrstuvwxy'), index=list('abcdefgh'))
df

abs_corrmat = np.abs(df.corr())
max_corr = abs_corrmat.apply(lambda x: sorted(x)[-2])
print('Maximum Correlation possible for each column: ', np.round(max_corr.tolist(), 2))

Maximum Correlation possible for each column:  [0.78 0.62 0.78 0.49 0.48 0.62 0.55 0.6  0.56 0.6 ]

### 62. How to create a column containing the minimum by maximum of each row?

In [85]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

min_by_max = df.apply(lambda x: np.min(x)/np.max(x), axis=1)

min_by_max

0    0.265957
1    0.021053
2    0.163265
3    0.020619
4    0.041667
5    0.015385
6    0.022222
7    0.204545
dtype: float64

### 64. How to normalize all columns in a dataframe?

In [87]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

out1 = df.apply(lambda x: ((x - x.mean())/x.std()).round(2))
print('Solution Q1\n',out1)

Solution Q1
       0     1     2     3     4     5     6     7     8     9
0 -0.21  1.13  1.55  1.25  0.04 -0.04 -1.33 -1.44 -0.10 -1.22
1  1.11 -1.42 -0.66  1.53  1.60  0.31  1.47  0.21 -1.93  1.24
2 -0.70 -1.33  0.20 -1.15 -1.26  0.39  0.47  1.03 -0.16  1.05
3 -0.89  0.08 -0.85 -0.74 -0.59  1.43  1.33  1.06  0.82 -0.02
4  0.04 -0.16  1.47  0.22 -0.11 -1.38 -0.75  0.07 -0.75 -0.73
5 -1.18  1.13 -0.88 -1.08 -0.02  0.57 -0.18  0.80  0.29 -0.48
6  1.74 -0.19 -0.66 -0.05  1.27  0.28 -0.54 -0.35  1.27 -0.95
7  0.09  0.75 -0.17  0.02 -0.93 -1.55 -0.47 -1.39  0.56  1.10

### 72. How to get the positions where values of two columns match?

In [90]:
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})
print(df)
np.where(df.fruit1 == df.fruit2)

   fruit1  fruit2
0  banana  banana
1  banana  banana
2  orange  banana
3   apple  orange
4  orange   apple
5   apple  banana
6  orange   apple
7   apple  orange
8  banana   apple
9  orange  banana

(array([0, 1], dtype=int64),)